In [5]:
import pandas as pd
import numpy as np

In [16]:
df = pd.read_csv('baby.csv')

In [17]:
df.head()

   Year       Name Sex  Number
0  1880       Mary   F    7065
1  1880       Anna   F    2604
2  1880       Emma   F    2003
3  1880  Elizabeth   F    1939
4  1880     Minnie   F    1746

In [26]:
spread = df.groupby('Name')['Year'].agg(['max', 'min'])

In [27]:
spread.head()

            max   min
Name
Aabha      2016  2011
Aabidah    2018  2018
Aabriella  2018  2008
Aada       2018  2015
Aadaya     2018  2018

In [29]:
summary = df.groupby('Name')['Number'].sum().reset_index()
summary.head()

        Name  Number
0      Aabha      35
1    Aabidah       5
2  Aabriella      38
3       Aada      13
4     Aadaya       8

In [31]:
results = summary.merge(spread, on='Name', how='left')

In [32]:
results['range'] = results['max'] - results['min']

In [33]:
results.head()

        Name  Number   max   min  range
0      Aabha      35  2016  2011      5
1    Aabidah       5  2018  2018      0
2  Aabriella      38  2018  2008     10
3       Aada      13  2018  2015      3
4     Aadaya       8  2018  2018      0

In [34]:
results.to_csv('wtf.csv')